Revit 2026 API

# TemperatureRatingTypeRemoveCorrectionFactor Method

---

Remove an existing correction factor from this temperature rating type in Revit MEP project.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveCorrectionFactor(
	CorrectionFactor correctionFactor
)
```
```vb
Public Sub RemoveCorrectionFactor (
	correctionFactor As CorrectionFactor
)
```
```cpp
public:
void RemoveCorrectionFactor(
	CorrectionFactor^ correctionFactor
)
```
```fsharp
member RemoveCorrectionFactor :
        correctionFactor : CorrectionFactor -> unit
```

#### Parameters

correctionFactor CorrectionFactor
    The correction factor to be removed.

#### Return Value

New constructed correction factor.

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace